Tekla Open API Reference for Tekla Structures 2025
DrawingSelector Class
 The DrawingSelector class provides functionality for accessing the drawing list dialog.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.UI.DrawingSelector
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class DrawingSelector
Public NotInheritable Class DrawingSelector
The DrawingSelector type exposes the following members.
Methods
Name | Description
GetSelected
 Gets the drawings that are currently selected in the drawing list dialog.
Top
Examples
 The following example deletes the selected drawings:
using Tekla.Structures.Drawing;
public class Example
{
       public void Example1()
       {
           DrawingHandler MyDrawingHandler = new DrawingHandler();
           if(MyDrawingHandler.GetConnectionStatus())
           {
               DrawingEnumerator SelectedDrawings = MyDrawingHandler.GetDrawingSelector().GetSelected();
               while(SelectedDrawings.MoveNext())
               {
                   SelectedDrawings.Current.Delete();
               }
           }
       }
}
See Also
Reference
Tekla.Structures.Drawing.UI Namespace